In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('hiring.csv')
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

## Data handeling of experience part

In [3]:
df.experience = df.experience.fillna("Zero") #Filling all the NA values with Zero with the help of fillna().
df.experience

0      Zero
1      Zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [4]:
New_experience = np.array(df.experience) #Taking the values in experience variable
length = len(df.experience)

In [5]:
from word2number import w2n  # taking the help of method -> w2n.word_to_num("Any string number") to convert

for i in range(length):
    New_experience[i] = w2n.word_to_num(New_experience[i]) #Assigning the values in the experience array
New_experience

array([0, 0, 5, 2, 7, 3, 10, 11], dtype=object)

In [6]:
df.experience = New_experience
df

  experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2          5         6.0                7   60000
3          2        10.0               10   65000
4          7         9.0                6   70000
5          3         7.0               10   62000
6         10         NaN                7   72000
7         11         7.0                8   80000

In [7]:
import math
new_exp = math.floor(df.experience.median())

In [8]:
# df.experience[0] = new_exp It cant work for millions of datas
# df.experience[1] = new_exp

for i in range(length):
    if(df.experience[i]==0):
        df.experience[i] = new_exp

C:\Users\PRANABESH DEY\AppData\Local\Temp\ipykernel_29108\3899023745.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.experience[i] = new_exp

In [9]:
# New_experience = np.array(df.experience).reshape(-1,1)
# New_experience

## Handeling data for test score part

In [10]:
import math
test_score_data = math.floor(df.test_score.median())
df.test_score = df.test_score.fillna(test_score_data)

In [11]:
df

  experience  test_score  interview_score  salary
0          4         8.0                9   50000
1          4         8.0                6   45000
2          5         6.0                7   60000
3          2        10.0               10   65000
4          7         9.0                6   70000
5          3         7.0               10   62000
6         10         8.0                7   72000
7         11         7.0                8   80000

In [12]:
from sklearn.linear_model import LinearRegression

In [13]:
model = LinearRegression()
model.fit(df[['experience','test_score','interview_score']],df.salary)

LinearRegression()

In [14]:
model.predict([[3,9,4]])

C:\AnacondaProgram\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([43363.28771899])